<template>
  <chinese-example
    v-bind="$attrs"
    local-storage-key="03-classifierJson"
    :ml-code="code"
  />
</template>

<script>
  import dedent from 'dedent'
  import ChineseExample from './chinese'
  export default {
    name: 'naivebayes-example-writer',
    title: 'Writer 文章作者用例',
    components: {
      ChineseExample
    },
    data () {
      return {
        code: dedent`
          // 已实例化
          console.log(classifier)

          // 鲁迅文章学习
          classifier.learn('我常想在纷扰中寻出一点闲静来,然而委实不容易.目前是这么离奇,心里是这么芜杂.一个人做到只剩了回忆的时候,生涯大概总要算是无聊了罢,但有时竟会连回忆也没有.中国的做文章有轨范,世事也仍然是螺旋.前几天我离开中山大学的时候,便想起四个月以前的离开厦门大学；听到飞机在头上鸣叫,竟记得了一年前在北京城上日日旋绕的飞机.我那时还做了一篇短文,叫做《一觉》.现在是,连这“一觉”也没有了。广州的天气热得真早,夕阳从西窗射入,逼得人只能勉强穿一件单衣.书桌上的一盆“水横枝”,是我先前没有见过的：就是一段树,只要浸在水中,枝叶便青葱得可爱.看看绿叶,编编旧稿,总算也在做一点事.做着这等事,真是虽生之日,犹死之年,很可以驱除炎热的。前天,已将《野草》编定了；这回便轮到陆续载在《莽原》上的《旧事重提》,我还替他改了一个名称：《朝花夕拾》.带露折花,色香自然要好得多,但是我不能够.便是现在心目中的离奇和芜杂,我也还不能使他即刻幻化,转成离奇和芜杂的文章.或者,他日仰看流云时,会在我的眼前一闪烁罢。我有一时,曾经屡次忆起儿时在故乡所吃的蔬果：菱角、罗汉豆、茭白、香瓜.凡这些,都是极其鲜美可口的；都曾是使我思乡的蛊惑.后来,我在久别之后尝到了,也不过如此；惟独在记忆上,还有旧来的意味存留.他们也许要哄骗我一生,使我时时反顾。这十篇就是从记忆中抄出来的,与实际容或有些不同,然而我现在只记得是这样.文体大概很杂乱,因为是或作或辍,经了九个月之多.环境也不一：前两篇写于北京寓所的东壁下；中三篇是流离中所作,地方是医院和木匠房；后五篇却在厦门大学的图书馆的楼上,已经是被学者们挤出集团之后了.', '鲁迅')
          classifier.learn('成熟是一种明亮而不刺眼的光辉，一种圆润而不腻耳的音响，一种不需要对别人察颜观色的从容，一种终于停止了向周围申诉求告的大气，一种不理会哄闹的微笑，一种洗刷了偏激的淡漠，一种无须声张的厚实，一种并不陡峭的高度。人呢，能直立了，自然是一大进步;能说话了，自然又是一大进步;能写字作文了，自然又是一大进步。然而也就堕落，因为那时也开始了说空话。说空话尚无不可，甚至于连自己也不知道说着违心之论，则对于只能嗥叫的动物，实在免不得“颜厚有忸怩” 。如果黑板就是浩淼的大海，那么，老师便是海上的水手。铃声响起那刻，你用教职工鞭作浆，划动那船只般泊在港口的课本。课桌上，那难题堆放，犹如暗礁一样布列，你手势生动如一只飞翔的鸟，在讲台上挥一条优美弧线——船只穿过……天空飘不来一片云，犹如你亮堂堂的心，一派高远。柔和的阳光斜挂在苍松翠柏不凋的枝叶上，显得那么安静肃穆，绿色的草坪和白色的水泥道貌岸然上，脚步是那么轻起轻落，大家的心中却是那么的激动与思绪波涌。　我有一时，曾经屡次忆起儿时在故乡所吃的蔬果：菱角、罗汉豆、茭白、香瓜。凡这些，都是极其鲜美可口的;都曾是使我思乡的蛊惑。后来，我在久别之后尝到了，也不过如此;惟独在记忆上，还有旧来的意味存留。他们也许要哄骗我一生，使我时时反顾。生命是盛开的花朵，它绽放得美丽，舒展，绚丽多资;生命是精美的小诗，清新流畅，意蕴悠长;生命是优美的乐曲，音律和谐，宛转悠扬;生命是流淌的江河，奔流不息，滚滚向前。生命的美丽，永远展现在她的进取之中;就像大树的美丽，是展现在它负势向上高耸入云的蓬勃生机中;像雄鹰的美丽，是展现在它搏风击雨如苍天之魂的翱翔中;像江河的美丽，是展现在它波涛汹涌一泻千里的奔流中。生活如花，姹紫嫣红;生活如歌，美妙动听;生活如酒，芳香清醇;生活如诗，意境深远，绚丽多彩。生活是一位睿智的长者，生活是一位博学的老师，它常常春风化雨，润物无声地为我们指点迷津，给我们人生的启迪。生活是一部大百科全书，包罗万象;生活是一把六弦琴，弹奏出多重美妙的旋律：生活是一座飞马牌大钟，上紧发条，便会使人获得浓缩的生命。生活的海洋并不像碧波涟漪的西子湖，随着时间的流动，它时而平静如镜，时而浪花飞溅，时而巨浪冲天……人们在经受大风大浪的考验之后，往往会变得更加坚强。生活，就是面对现实微笑，就是越过障碍注视未来;生活，就是用心灵之剪，在人生之路上裁出叶绿的枝头;生活，就是面对困惑或黑暗时，灵魂深处燃起豆大却明亮且微笑的灯展。生活是蜿蜒在山中的小径，坎坷不平，沟崖在侧。摔倒了，要哭就哭吧，怕什么，不心装模作样!这是直率，不是软弱，因为哭一场并不影响赶路，反而能增添一份小心。山花烂漫，景色宜人，如果陶醉了，想笑就笑吧，不心故作矜持!这是直率，不是骄傲，因为笑一次并不影响赶路，反而能增添一份信心。', '鲁迅')
          classifier.learn('人生的路漫长而多彩，就像在天边的大海上航行，有时会风平浪静，行驶顺利;而有时却会是惊涛骇浪，行驶艰难。但只要我们心中的灯塔不熄灭，就能沿着自己的航线继续航行。人生的路漫长而多彩：在阳光中我学会欢笑，在阴云中我学会坚强;在狂风中我抓紧希望，在暴雨中我抓紧理想;当我站在中点回望，我走出了一条属于我的生之路。假如生活中你失败了，请不要将忧伤的泪水写在脸上。失败也是一种收获，生活中最得要的是有一份十足的勇气和一个创业的胆量。希望源于失望，奋起始于忧患，正如一位诗人所说：有饥饿感受的人一定消化好，有紧迫感受的人一定效率高，有危机感受的人一定进步快。　往事如歌，在人生的旅途中，尽管有过坎坷，有过遗憾，却没有失去青春的美丽。相信自己，希望总是有的，让我们记住那句话：错过了太阳，我不哭泣，否则，我将错过月亮和星辰。别在树下徘徊，别在雨中沉思，别在黑暗中落泪。向前看，不要回头，只要你勇于面对抬起头来，就会发现，分数的阴霾不过是短暂的雨季。向前看，还有一片明亮的天，不会使人感到彷徨。', '鲁迅')
          classifier.learn('中国中流的家庭，教孩子大抵只有两种法。其一是任其跋扈，一点也不管，骂人固可，打人亦无不可，在门内或门前是暴主，是霸王，但到外面便如失了网的蜘蛛一般，立刻毫无能力。其二，是终日给以冷遇或呵斥，甚于打扑，使他畏葸退缩，彷佛一个奴才，一个傀儡，然而父母却美其名曰『听话』，自以为是教育的成功，待到他们外面来，则如暂出樊笼的小禽，他决不会飞鸣，也不会跳跃。', '鲁迅')
          classifier.learn('战士死了的时候，苍蝇所首先发见的是他的缺点和伤痕，嘬，营营地叫，以为得意，以为比死了的战士更英雄。但是战士已经死了，不再来挥去它们。于是乎苍蝇们即更其营营地叫，自以为倒是不朽的声音，因为它们的完全，远在战士之上。的确的，谁也没有发见过苍蝇们的缺点和创伤。然而，有缺点的战士终竟是战士，完美的苍蝇也终竟不过是苍蝇', '鲁迅')
          classifier.learn('群众，尤其是中国的——永远是戏剧的看客。牺牲上场，如果显得慷慨，他们就看了悲壮剧;如果显得觳觫(即恐惧颤抖)，他们就看了滑稽剧。北京的羊肉铺常有几个人张嘴看剥羊，仿佛颇为愉快，人的牺牲能给他们的益处，也不过如此。而况事后走不几步，他们并这一点也就忘了。——《娜拉走后怎样》一九二六', '鲁迅')
          classifier.learn('我先前的攻击社会，其实也是无聊的。社会没有知道我在攻击，倘一知道，我早已死无葬身之所了……我之得以偷生者，因为他们大多数不识字，不知道，并且我的话也无效力，如一箭之入大海。否则，几条杂感，就可以送命的。民众的惩罚之心，并不下于学者和军阀。——《答有恒先生》一九二七年', '鲁迅')
          classifier.learn('这少年便是闰土。我认识他时，也不过十多岁，离现在将有三十年了；那时我的父亲还在世，家景也好，我正是一个少爷。那一年，我家是一件大祭祀的值年⑶。这祭祀，说是三十多年才能轮到一回，所以很郑重；正月里供祖像，供品很多，祭器很讲究，拜的人也很多，祭器也很要防偷去。我家只有一个忙月（我们这里给人做工的分三种：整年给一定人家做工的叫长工；按日给人做工的叫短工；自己也种地，只在过年过节以及收租时候来给一定人家做工的称忙月），忙不过来，他便对父亲说，可以叫他的儿子闰土来管祭器的。我的父亲允许了；我也很高兴，因为我早听到闰土这名字，而且知道他和我仿佛年纪，闰月生的，五行缺土⑷，所以他的父亲叫他闰土。他是能装〔弓京〕捉小鸟雀的。', '鲁迅')
          classifier.learn('我于是日日盼望新年，新年到，闰土也就到了。好容易到了年末，有一日，母亲告诉我，闰土来了，我便飞跑的去看。他正在厨房里，紫色的圆脸，头戴一顶小毡帽，颈上套一个明晃晃的银项圈，这可见他的父亲十分爱他，怕他死去，所以在神佛面前许下愿心，用圈子将他套住了。他见人很怕羞，只是不怕我，没有旁人的时候，便和我说话，于是不到半日，我们便熟识了。我们那时候不知道谈些什么，只记得闰土很高兴，说是上城之后，见了许多没有见过的东西。', '鲁迅')
          classifier.learn('“这不能。须大雪下了才好。我们沙地上，下了雪，我扫出一块空地来，用短棒支起一个大竹匾，撒下秕谷，看鸟雀来吃时，我远远地将缚在棒上的绳子只一拉，那鸟雀就罩在竹匾下了。什么都有：稻鸡，角鸡，鹁鸪，蓝背……”', '鲁迅')

          // 老舍文章学习
          classifier.learn('在那棵婀娜的柳树下，我架个秋千，戴着用柳枝编成的花环，在秋千上摇来荡去。清凉的风徐徐吹过发间，一如你清爽的目光从我的脸颊掠过，掠走的是我颊上一抹微红的羞色，留下的是我心头几许美奂的遐思。我在秋千上摇啊摇，我的心被摇回了少女时的纤柔细弱。', '老舍')
          classifier.learn('今年开春，我决定再也不哭了，虽然自己很残缺，没有风的自由，没有鱼的走动，没有人类的智慧，但是我发现自己除了有一颗多愁善感的心，还拥有一副好嗓子！这，就足够了！我要用美妙的歌声，让知了爱上我，让那路过的女孩停下来为我鼓掌，让来这里的情侣充满欢笑', '老舍')
          classifier.learn('满月的小猫更可爱，腿脚还不稳，可是已经学会淘气。一根鸡毛，一个线团，都是它们的好玩具，耍个没完没了。一玩起来，它们不知要摔多少跟头，但是跌到了马上起来，再跑再跌。它们的头撞在门上、桌腿上，彼此的头上，撞疼了也不哭。它们的胆子越来越大，逐渐开辟新的游戏场所。它们到院子里来了，院中的花草可遭了殃。它们在花盆里摔交，抱着花枝打秋千，所过之处，枝折花落。你见了，绝不会责打它们，它们是那么生机勃勃，天真可爱！', '老舍')
          classifier.learn('在一片青幽幽的芳草地上，流过一条清澈见底的小溪，溪水多么清，溪水映着蓝天，映着灿烂的朝霞，也映着山上松树林的倒影。我禁不住捧起溪水喝了一口：清凉甘甜，沁人心脾，莫不是王母娘娘蟠桃盛会上的琼浆玉液？可是，当我指尖触及溪水时，双手感到异常冰凉。啊，是它那冰清玉洁的肌肤，容不得你亵玩。', '老舍')
          classifier.learn('六月，六月的湖面本来是可以微波荡漾的。骑着单车沿着平缓的公路一直到水上公园，尽管那是个老师们坚决要求不许去的地方，因为那里有许多溺水的灵魂，因为失足，或者别的，可那里感觉不到一丝的寒意，风景总是很好，我会坐在无边的草地上，远远的望着湖面，静静的，静静的听水草在湖里疯长的声音', '老舍')
          classifier.learn('微风仿佛会给那点微光吹到我的心上来，使我想起过去，更加重了眼前的悲哀。我的心就好象在月光下的蝙蝠，虽然是在光的下面，可是自己是黑的；黑的东西，即使会飞，也还是黑的，我没有希望。我可是不哭，我只常皱着眉。', '老舍')
          classifier.learn('那第一次，带着寒气的月牙儿确是带着寒气。它第一次在我的云中是酸苦，它那一点点微弱的浅金光儿照着我的泪。', '老舍')
          classifier.learn('祥子的手哆嗦得更厉害了，揣起保单，拉起车，几乎要哭出来。拉到个僻静地方，细细端详自己的车，在漆板上试着照照自己的脸！越看越可爱，就是那不尽合自己的理想的地方也都可以原谅了，因为已经是自己的车了。把车看得似乎暂时可以休息会儿了，他坐在了水簸箕的新脚垫儿上，看着车把上的发亮的黄铜喇叭。他忽然想起来，今年是二十二岁。因为父母死得早，他忘了生日是在哪一天。', '老舍')

          // 判断分类
          console.log('预期：鲁迅，实际：', classifier.categorize('我在年青时候也曾经做过许多梦，后来大半忘却了，但自己也并不以为可惜。所谓回忆者，虽说可以使人欢欣，有时也不免使人寂寞，使精神的丝缕还牵着己逝的寂寞的时光，又有什么意味呢，而我偏苦于不能全忘却，这不能全忘的一部分，到现在便成了《呐喊》的来由。'))
          console.log('预期：鲁迅，实际：', classifier.categorize('中国各处是壁，然而无形，像『鬼打墙』一般，使你随时能『碰』，能打这墙的，能碰而不感到痛苦的，是胜利者。'))
          console.log('预期：老舍，实际：', classifier.categorize('多少次了，我看见跟现在这个月牙儿一样的月牙儿，它带着种种不同的感情，种种不同的景物，它一次一次的在我记忆中的碧云上斜挂着。它唤醒了我的记忆，象一阵晚风吹破一朵欲睡的花。'))
          console.log('预期：老舍，实际：', classifier.categorize('两三个星期的工夫，他把腿溜出来了。他晓得自己的跑法很好看。跑法是车夫的能力与资格的证据。那撇着脚，像一对蒲扇在地上扇乎的，无疑的是刚由乡间上来的新手。那头低得很深，双脚蹭地，跑和走的速度差不多，而颇有跑的表示的，是那些五十岁以上的老者们。那经验十足而没什么力气的却另有一种方法；胸向内含，度数很深；腿抬得很高；一走一探头；这样，他们就带出跑得很用力的样子，而在事实上一点也不比别人快；他们仗着“作派”去维持自己的尊严。祥子当然决不采取这几种姿态。他的腿长步大，腰里非常的稳，跑起来没有多少响声，步步都有些伸缩，车把不动，使座儿觉到安全，舒服。说站住，不论在跑得多么快的时候，大脚在地上轻蹭两蹭，就站住了；他的力气似乎能达到车的各部分。脊背微俯，双手松松拢住车把，他活动，利落，准确；看不出急促而跑得很快，快而没有危险。就是在拉包车的里面，这也得算很名贵的。他确乎有点像一棵树，坚壮，沉默，而又有生气。他有自己的打算，有些心眼，但不好向别人讲论。在洋车夫里，个人的委屈与困难是公众的话料，“车口儿”上，小茶馆中，大杂院里，每人报告着形容着或吵嚷着自己的事，而后这些事成为大家的财产，像民歌似的由一处传到一处。祥子是乡下人，口齿没有城里人那么灵便；设若口齿灵利是出于天才，他天生来的不愿多说话，所以也不愿学着城里人的贫嘴恶舌。他的事他知道，不喜欢和别人讨论。因为嘴常闲着，所以他有工夫去思想，他的眼仿佛是老看着自己的心。只要他的主意打定，他便随着心中所开开的那条路儿走；假若走不通的话，他能一两天不出一声，咬着牙，好似咬着自己的心!'))

          // 输出学习进度
          const classifierJson = classifier.toJson()
          console.log('学习进度：', classifierJson)
        `
      }
    }
  }
</script>
