<template>
  <chinese-example
    v-bind="$attrs"
    local-storage-key="04-classifierJson"
    :ml-code="code"
  />
</template>

<script>
  import dedent from 'dedent'
  import ChineseExample from './chinese'
  export default {
    name: 'naivebayes-example-news',
    title: 'News 新闻类别用例',
    components: {
      ChineseExample
    },
    data () {
      return {
        code: dedent`
          // 已实例化
          console.log(classifier)

          // 学习体育分类的文章
          classifier.learn('北京时间4月23日19点35分，2017赛季中超联赛第6轮，山东鲁能坐镇主场迎战重庆力帆。第28分钟，鲁能后场传球失误，送给费尔南多单刀球机会，“小摩托”轻松破门打破僵局。第82分钟，佩莱打入本赛季首球，帮助鲁能扳平比分。最终，鲁能主场和力帆1-1握手言和。前5轮结束，鲁能在积分榜上仅落后榜首的广州富力1分，不过他们上一轮的表现却与之前几场截然相反，本赛季首次在上半场取得进球，下半场的表现不如之前那般“惹不起”。本场比赛如果鲁能取胜，主场将迎来4连胜，继续紧追领头羊。三轮一场未胜仅排名第13位的力帆连续两场都以2-1战胜对手，排名迅速蹿升至第6位。首发阵容方面，上一场出战的塔尔德利休战，马加特选择了西塞与佩莱搭档，U23球员刘洋首次出场担当左后卫；力帆方面则是延续了上一场的阵容。第8分钟，戴琳距离球门35米开外远射高出。第11分钟，金敬道前场上抢成功，蒿俊闵直塞，佩莱脚后跟妙传西塞，可惜被对方解围，左路的吴兴涵得球内切射门打在对方身上偏出底线。第16分钟，力帆获得左侧角球，费尔南多开到禁区内，无人盯防的卡尔德克头槌，险些破门。', '体育')
          classifier.learn('曾就职于中国国家队、北京国安、深圳红钻和贵州人和，司职守门员助教的托米奇因急性白血病去世，享年57岁。去年12月托米奇检查出了急性白血病，经济拮据的他向中国朋友们发出求助，包括北京人和俱乐部、北京国安俱乐部、深圳红钻俱乐部以及球迷朋友们都为托米奇筹款治病，遗憾的是，这位中国足球的朋友并没有战胜病魔。据悉，4月22日晚，国安翻译蒋晓军在个人社交网站上说道，“今天的白天是再平常不过的一天，但10分钟前马尔科的电话却让它变得不再平常，要求他重复说了两遍，我才敢相信自己的耳朵，马尔科哭着告诉我的坏消息竟然是：大家熟悉爱戴的托米奇永远离我们而去了！老托啊，在病魔向你射出这一脚爆射时，你太大意了，你竟然没有象往常那样拼力守住你身后的球门。走好，老托，天堂里还会有足球。”去年10月份，托米奇被确诊为急性白血病。尽管托米奇从事足球工作多年，但是他并没有太多的存款。住院后的托米奇在治疗方面的费用巨大，经济本就相对拮据的他不得不向曾经就职过的中国俱乐部开口求助。包括北京人和俱乐部、北京国安俱乐部、深圳红钻俱乐部以及球迷朋友们都在通过各种渠道为托米奇筹款治病。在中国朋友们的帮助下，托米奇获得了一笔治疗资金。在去年年底，托米奇成功找到了合适的骨髓移植者并配型成功，正当球迷们认为他将开启新的美好生活时，病魔再次侵袭了他。', '体育')
          classifier.learn('去年年底，当球队重新集结，备战2017赛季的时候，大家最直观的感觉是瓜林变了，人瘦了，小肚腩没有了。联赛开始后，大家又惊喜地发现瓜林的改变不仅仅于此，那位国米队长回来了。瓜林不仅在后腰位置防守稳健，在进攻端也是贡献突出。已经进行的6轮中超联赛，瓜林打入了3球。实际上，赛季之初得知自己落选亚冠名单，瓜林是非常失落的，他甚至怀疑球队是不是已经不再需要自己了。采访中，短短的1分钟里，瓜林甚至3次提到了“失落”这个词，但是他及时调整好心态，以出色的表现证明了自己。与贵州智诚比赛结束后当晚，瓜林在球队下榻的酒店接受了小编的专访。采访开始前，瓜林以商量的语气问，我是不是可以先去一趟洗手间。他说话时的语气语调甚至表情，都让小编怀疑，这就是在场上那位横眉怒目，充满了杀气的瓜林。等瓜林上完洗手间回来，翻译王侃因为主教练波耶特有事，被叫走了。王侃回来前的几分钟，瓜林耐心地等待着，没有看表，没有催促，尽管他其实已经很累，特别希望早一点回房间休息。', '体育')
          classifier.learn('北京时间4月23日，中超联赛第6轮，长春亚泰队坐镇主场迎来河南建业的挑战。谭龙打入制胜球，最终亚泰主场1-0战胜建业，获得新赛季的首场胜利。亚泰前5轮1平4负未尝胜绩，最近3个主场1平2负，上轮更是遭申花绝杀；而河南建业前5轮同样不胜，不过取得了3平2负的成绩，但建业赛季的前2个客场都是以0-1的比分输球。两队中超史上交手18次，亚泰6胜7平5负略占上风，而且9个主场亚泰4胜5平保持不败，2015和2016赛季，亚泰连续在主场战胜建业。比赛刚刚开始，马里尼奥发出前场右侧底线附近定位球到禁区前点，可惜皮球打在了孙捷身上出了底线。第8分钟，顾操正面一个凶猛的滑铲将马利尼奥其放倒，吃到开场后第一张黄牌。第16分钟，亚泰再度获得任意球机会，马利尼奥主罚将球给到禁区后点，吴龑出击直接将球摘下。第18分钟，裴帅中路推进被钟晋宝铲倒在地，钟晋宝也吃到了黄牌。第20分钟，奇卡尔拿球后和巴索戈在禁区线上撞墙配合，多奇卡尔杀入禁区横敲，胡靖航跟上一脚爆射偏出。第22分钟蒋哲一脚远射被吴龑扑出了底线。第25分钟，亚泰再次获得任意球机会，左侧张笑非主罚开到禁区，落点太深直接被被吴龑没收。第38分钟，巴索戈停球被伊斯梅洛夫放倒，亚泰教练席围住了边裁，王迪警告建业教练席。第40分钟，建业任意球机会，多奇卡尔主罚开起来到禁区，戈麦斯顶了一下，龙成门前抢点将球打进，但裁判示意戈麦斯手球犯规，进球无效。上半场双方暂时0-0互交白卷。第53分钟，双方拼抢时外力踢在胡斯蒂膝盖上，吃到一张黄牌。第57分钟，建业率先进行换人调整，顾操被杨昌鹏替下。第58分钟，亚泰右侧角球机会，胡斯蒂搓起来开到后点，吴龑出击把球击出。第63分钟，建业再次换人，外力被柯钊替下。第65分钟，亚泰用老将杜震宇替下了裴帅。第66分钟，杨阔撞人犯规吃点黄牌。亚泰任意球机会，杜震宇挑传到禁区左侧，孙捷一漏，伊斯梅洛夫门前拿球越位了。第70分钟，亚泰打破场上僵局，胡斯蒂接到杜震宇直传后三十米区域前中路一脚直塞，谭龙反越位成功，单刀面对门将右脚推射破门！亚泰1-0领先建业。第74分钟，亚泰U23球员何超抽筋倒地，随后无法坚持被张力换下。第75分钟，大禁区线附近龙成的一脚抽射打高了，错失扳平机会。第80分钟，亚泰获得位置绝佳的任意球机会，马里尼奥主罚直接轰门高出横梁。第84分钟，建业换人，杜长杰替下刘恒。最终全场比赛结束，亚泰1-0战胜建业。', '体育')
          classifier.learn('北京时间4月22日，北京首钢俱乐部副总经理谢海田，宣布同马布里解除合同，这也意味着马布里将以自由身离开球队。马布里的北京时代，也正式宣告落下帷幕。据悉，北京首钢同马布里之间的2年合同，约定老马拥有着在2017/2018赛季担任球员或助理教练的选择权。尽管马布里希望继续再为北京队征战一个赛季，但俱乐部经过同各界商讨之后，觉得马布里作为教练，能够给球队带来更大的帮助。北京首钢也在合同要求的期限内向马布里发文，希望他能够担任助理教练的职务。4月6日和9日时，北京首钢同马布里之间的2次会面里，希望老马能够出任教练。4月11日时，马布里团队代表老马做出回应，希望能够再继续征战一个赛季。4月14日时，北京队发函，希望马布里能够担任教练职务，但老马表示无法接受。4月19日时，双方再次展开磋商谈判，俱乐部提出马布里可以担任球员兼教练。但双方在薪资上差距较大未能达成一致。最终北京首钢决定放弃合同，同意马布里离队。马布里在2011/2012赛季加盟北京队，并且效力迄今，帮助球队夺取2011/2012、2013/2014和2014/2015赛季总冠军，实现三冠王的霸业。但上赛季的CBA，北京队却未能闯入季后赛，这也创造了老马时代球队的最差战绩。随着马布里同北京队解除合同，正式宣布北京的马布里时代落下帷幕……', '体育')
          classifier.learn('北京时间4月23日19时35分，2017中超第6轮，山东鲁能主场1-1战平重庆力帆。央视对本场比赛进行现场直播，徐阳和贺炜做出精彩解说。徐阳赞扬戴琳愈发的成熟，“现在戴琳成熟了，再不成熟就来不及了。”两位解说为鲁能进攻端支招，“鲁能进攻时，应该避开米洛维奇。米洛维奇的制空能力很强，他的防守面积也很大。”贺炜谈到U23新政的话题，“足协制定U23政策的初衷是好的，但过了保护期，球员还能站稳脚跟吗？看看刘彬彬的处境就制定了。”第27分钟费尔南多为力帆打破僵局，两位解说进行点评，“这个球给王大雷处理更安全，王彤这里很难处理。戴琳和王彤的失误，给了费尔南多这样的机会。马加特不是很高兴，这样丢球让球队感到很窝囊，这样的失球对球队的士气打击也比较大。但毕竟比赛只打了30分钟，鲁能不要自乱节奏。”鲁能在进攻端缺少办法，徐阳点评时表示，“鲁能的控制能力不强，进攻端也有些脱节。”', '体育')

          // 学习金融分类的文章
          classifier.learn('4月20日，中国人民银行营业管理部联合银监会、北京市银监局、北京市住建委下发通知，要求房地产开发企业和房地产经纪机构开发房产交易时，履行反洗钱义务。从5月1日起，正式开始在北京市内开始实施。按照规定，开发商和中介机构对交易当事人身份进行有效核实、登记；房屋交易当事人须以本人银行卡转账方式进行，商业银行对当日单笔或累计交易超过5万元（含5万元）的现金缴存报告大额交易；发现可疑交易应向相关部门报告。一位接近北京市住建委人士表示，这一政策旨在加强房地产交易过程中资金监管力度，进一步避免房地产成为不法分子的洗钱通道，“不一定会完全杜绝洗钱，但起码查起来比较容易了。”该人士进一步透露，近年部分城市房价上涨较快的过程中，大量不法资金通过各种渠道进入房地产领域洗白，已经引起相关部门的警觉，“所以这个政策对普通老百姓(603883,股吧)影响不大，重点还是针对赃钱、黑钱。”', '金融')
          classifier.learn('自从2015年8月人民币面临贬值压力以来，离岸点心债市场就一路萎缩，到2016年下半年基本上处于冷冻期。按照年初的预测，2017年人民币依然会面临贬值压力，点心债或仍然难以走出冰冻。今年一季度的情况也的确符合市场预期，整个一季度，海外人民币点心债券都维持了零发行。不过这种状态在4月份被打破，而且更令市场诧异的是，这个打破零发行的并非传统的香港点心债市场，而是在遥远的南非最大城市约翰内斯堡。4月11日，中国银行(601988,股吧)发行了一单多币种多品种、总额为30亿美元的债券，其中包括15亿元的三年期人民币离岸债券，这也是2017年以来全球范围内首单公募发行人民币点心债。另外值得注意的是，该笔人民币债券的发行地是远在南非的约翰内斯堡，而且订单规模一度高达65亿，并最终以32亿元、2.13倍的认购倍数成功发行，发行票息为4.88%，稍高于国内同等级同期限人民币债券。“坦白讲，此次发行之前我们还是有点担心，毕竟人民币贬值导致去年市场上对人民币资产的兴趣显著缩减，离岸人民币市场的流动性也大规模降低。”一位接近交易的人士透露，人民币点心债市场尽管重启，但像前几年那么火爆的情况尚不具备。', '金融')
          classifier.learn('深交所对公司的公开谴责主要针对两方面事项：一、对子公司相关信息的披露不准确、不完整。2014年8月至2015年9月期间，安硕信息先后设立和参与设立了从事征信业务全资子公司、互联网金融控股子公司、云服务控股子公司和普惠金融业务参股公司。相关事项属于对安硕信息证券交易价格产生较大影响的重大事件。但安硕信息对于上述事项的披露不准确、不完整，主要表现为未在相关定期报告中披露相关信息、安硕信息对与子公司的资源投入、经营计划与子公司业务实际开展情况等信息与公告存在差异且无合理解释、规避相关子公司资质牌照申请面临的风险和困难、未充分揭示子公司业务面临的政策风险，以及未在收到子公司工商登记文件后及时履行临时信息披露义务等。二、在股票交易异常波动公告中未充分披露相关事项和风险。2014年5月至2015年5月期间，安硕信息股价出现多次异动，公司于2014年7月1日、2015年3月18日、2015年4月13日和2015年5月8日先后4次披露了《股票交易异常波动公告》。上述公告中，均未结合相关对外投资事项的进展情况、子公司业务开展情况、经营风险等因素披露相关信息，未能对市场质疑做出有效澄清。', '金融')
          classifier.learn('证券时报股市大数据新媒体“数据宝”统计，目前共有1644家(剔除已实施分红送转方案公司)公司披露了2016年年度分红送转预案，其中，149家公司年度拟每10股送转10股以上，18家公司年度拟每10股送转超过20股，1家公司的送转比例更是高达10:30以上，10送转10股以下的公司为172家。10送转10以上的高送转公司家数占所有预案公司的比例高达9%。', '金融')
          classifier.learn('创业板公司三五互联(300051,股吧)（300051.SZ）于4月6日发布了《重大资产购买报告书（草案）》，计划拟以11亿元现金收购成蹊科技100%股权，收购金额超过账面净资产20余倍。支撑成蹊科技超高溢价的原因就在于其原股东针对该公司未来的业绩承诺：2017年度、2018年度、2019年度及2020年度实现的扣非后净利润分别不低于8500万元、11050万元、13260万元及15912万元，然而,这相较该公司2016年实现的净利润3562.46万元，2015年664.71万元而言，未来业绩能否兑现是存在一定压力的。资金支付存在压力。在方案中，最引人关注的是三五互联的收购款支付方式。根据收购报告书披露，截止到成蹊科技股权完成交割后20个工作日内，三五互联需累计向成蹊科技原股东支付4.4亿元的收购价款。这对于货币资金并不充裕的三五互联而言是有一定压力的。根据公司发布的2016年年报显示，截止2015年末，三五互联的货币资金余额仅为13332.62万元，而作为本次收购的主体三五互联母公司，账面货币资金余额更是只有2008.12万元，不足未来短期内需支付收购价款的零头。', '金融')

          // 判断分类
          console.log('预期：体育，实际：', classifier.categorize('徐阳谈到鲁能应该加强二点的控制，“既然鲁能上场2个强力中锋进行二点包抄，那么就要形成对二点的控制。”第54分钟鲁能用刘彬彬换下金敬道，徐阳谈到鲁能为何不刚开场便换人时表示，“场上的换人，对球员还是会产生一些影响，马加特的情商很高，他同年轻球员谈话都很长，年轻球员对他的想法也很认同，双方也能形成很好的沟通。”'))
          console.log('预期：体育，实际：', classifier.categorize('火箭队主帅迈克-德安东尼并不担心雷霆队阵容当中的这些变化，“我不关心他们做什么，我会继续拿安德森使用小个阵容，我想每支球队都可以做他们想做的，我们按照自己方式去做。我不关心对方是怎样限制我们，我们能够继续得分，要做的就是提高防守。”'))
          console.log('预期：金融，实际：', classifier.categorize('消费和医药股最近基本没跌，而小票相对跌的比较多，尤其是中证1000指数竟然跌了约5.16%。市场整体而言，目前500亿市值以上的公司有赚头，而100亿市值以下的公司（很多是概念类股票）平均跌幅很多。所以在结构性行情机会中，很多投资者的感觉是市场在“冒慢牛之名，行慢熊之实”。'))
          console.log('预期：金融，实际：', classifier.categorize('　和讯信托消息 苏国信18日公告，拟向不超过10名特定对象非公开发行股票募集资金，预计募资40亿元，增资江苏信托。本次发行的股票数量不超过650,629,064股，募集资金总额不超过人民币400,000.00万元，扣除发行费用后将用于增资江苏信托补充净资本，实施方式为由公司向公司控股子公司江苏省国际信托有限责任公司进行增资。'))

          // 输出学习进度
          const classifierJson = classifier.toJson()
          console.log('学习进度：', classifierJson)
        `
      }
    }
  }
</script>
